insert into plz_tc_fd.tb_contents_made_nature
values (1,0,0,'korea','한국','Y','2023-01-04 03:04:29','2023-01-04 03:04:29')
     ,(2,0,0,'japan','일본','Y','2023-01-04 03:04:29','2023-01-04 03:04:29');

--

insert into plz_tc_fd.tb_user_type
values (1,'GUEST','Y','2023-01-02 21:51:42','2023-01-02 21:51:42')
     ,(2,'ADMIN','Y','2023-01-02 21:51:42','2023-01-02 21:51:42')
     ,(3,'SUPER_ADMIN','Y','2023-01-02 21:51:42','2023-01-02 21:51:42');

--

insert into plz_tc_fd.tb_user
values (100,3,'brandon5959somi@gmail.com','test123','이도겸','Y','2023-01-11 22:45:00','2023-01-11 22:45:00');

--

insert into plz_tc_fd.tb_anime
values (124,2,'무사쥬베이','카와지리요시야키','https://www.naver.com','y',2,'Y','2000-09-30 00:00:00','2023-01-23 14:44:34','2023-01-23 14:44:34')
,(125,2,'뱀파이어헌터D','카와지리요시야키','https://www.naver.com','y',1,'Y','1985-01-01 00:00:00','2023-01-23 14:46:50','2023-01-23 14:46:50')
,(126,2,'마법기사레이어스OVA','CLAMP','https://www.naver.com','y',3,'Y','1993-11-01 00:00:00','2023-01-23 14:49:32','2023-01-23 14:49:32')
,(127,2,'천공의 에스카플로네','아카네 가즈키(선라이즈)','https://www.naver.com','y',26,'Y','1996-04-02 00:00:00','2023-01-23 14:51:48','2023-01-23 14:51:48')
,(128,2,'닌자거북이(실사극장판)','Lloyd Goldfine','https://www.naver.com','y',1,'Y','1987-12-14 00:00:00','2023-01-23 14:54:51','2023-01-23 14:55:25')
,(129,2,'나의 지구를 지켜줘','하나토유메','https://www.naver.com','y',9,'Y','1993-12-17 00:00:00','2023-01-23 15:04:47','2023-01-23 15:04:47')
,(130,2,'건담w 엔드리스 왈츠  HD Remaster','히와타리 사키','https://www.naver.com','y',4,'Y','2000-01-01 00:00:00','2023-01-23 15:05:56','2023-01-23 15:13:47')
,(131,2,'요수도시','카와지리요시야','https://www.naver.com','y',1,'Y','1987-01-01 00:00:00','2023-01-23 15:08:06','2023-01-23 15:08:06')
,(132,2,'3x3eyes 성마전설 OVA','니시오 다이스케','https://www.naver.com','y',7,'Y','1991-01-01 00:00:00','2023-01-23 15:11:17','2023-01-23 15:13:37')
,(134,2,'7개의대죄','스즈키 나카바','https://www.naver.com','y',23,'Y','2000-01-01 00:00:00','2023-01-23 15:13:21','2023-01-23 15:13:21')
,(135,2,'공상과학세계 걸리버보이','타케가미 준키','https://www.naver.com','y',44,'Y','1995-01-08 00:00:00','2023-01-23 15:18:50','2023-01-23 15:18:50')
,(136,2,'데카맨 오리지널','??','https://www.naver.com','y',26,'Y','1970-01-01 00:00:00','2023-01-23 15:24:12','2023-01-23 15:24:12')
,(138,2,'데카맨','네기시 히로시','https://www.naver.com','y',44,'Y','1992-02-18 00:00:00','2023-01-23 15:53:25','2023-01-23 15:53:25')
,(139,2,'데카맨 OVA','네기시 히로시','https://www.naver.com','y',6,'Y','1994-01-01 00:00:00','2023-01-23 16:12:35','2023-01-23 16:12:35')
,(140,1,'녹색전차 해모수 1~26','김재환','https://www.naver.com','y',26,'Y','1997-12-12 00:00:00','2023-01-23 16:15:29','2023-02-02 22:03:37')
,(141,2,'드래곤볼GT 1~20','토리야마아키라','https://www.naver.com','y',64,'Y','1996-02-07 00:00:00','2023-01-23 16:24:42','2023-01-23 16:24:42')
,(142,2,'드래곤볼GT 21~40','토리야마 아키라','https://www.naver.com','y',64,'Y','1996-02-07 00:00:00','2023-01-23 16:25:18','2023-01-23 16:25:18')
,(143,2,'드래곤볼GT 41~64','토리야마 아키라','https://www.naver.com','y',64,'Y','1996-02-07 00:00:00','2023-01-23 16:26:18','2023-01-23 16:26:18')
,(144,2,'드래곤볼 점프 페스티벌','작가없음','드래곤볼 극장판 점프 페스티벌','y',1,'Y','2000-01-01 00:00:00','2023-01-23 16:27:50','2023-01-23 16:27:50')
,(145,2,'드래곤볼Z 극장판 01기 [갈릭Jr.의 야망-가릭주니어편]','토리야마아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-23 16:28:27','2023-01-23 16:28:27')
,(146,2,'드래곤볼Z 극장판 02기 [이 세상에서 가장 강한 녀석-닥터위로편]','토리야마 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-23 16:29:29','2023-01-23 16:29:29')
,(147,2,'드래곤볼Z 극장판 03기 [전 지구 초결전-타레스편]','토리얌 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-23 16:29:59','2023-01-23 16:29:59')
,(148,2,'드래곤볼Z 극장판 04기 [초사이어인이다 손오공-슬라그편]','토리야마 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-24 00:42:08','2023-01-24 00:42:08')
,(149,2,'드래곤볼Z 극장판 05기 [뛰어난 최강 대 최강-쿠우라편]','토리야마아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-24 00:42:45','2023-01-24 00:42:45')
,(150,2,'드래곤볼Z 극장판 06기 [격돌!! 100 억 파워의 전사들-메탈쿠우라편]','토리야마 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-24 00:43:41','2023-01-24 00:43:41')
,(151,2,'드래곤볼Z 극장판 07기 [극한 배틀!! 3대 초사이어인-인조인간13호편]','토리야마 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-24 00:47:46','2023-01-24 00:47:46')
,(152,2,'드래곤볼Z 극장판 08기 [불타올라라!! 열전 열전 초격전-브로리편]','토리야마 아키라','https://www.naver.com','y',1,'Y','2000-01-01 00:00:00','2023-01-24 00:48:37','2023-01-24 00:48:37')
,(188,2,'골든보이 1~6','에가와 타츠야','https://www.naver.com','y',6,'Y','2000-01-01 00:00:00','2023-02-02 21:55:11','2023-02-02 21:55:23');

--

insert into plz_tc_fd.tb_anime_searching_keyword
values (100,100,'디지','2023-01-11 22:45:07')
,(101,100,'디지몬','2023-01-11 22:45:07')
,(102,100,'어드','2023-01-11 22:45:07');

--

insert into plz_tc_fd.tb_anime_thumbnail_img
values (117,124,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcTxHObCKCHXYxr9AyFmQ9zGsClJPnfglK_HjduVPTZm5DdjY-mtjrN1cHY','2023-01-23 14:44:34','2023-01-23 14:44:34')
,(118,125,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcT9fdrNasGVru8me85ymOMA-Aj5oARHxbyJ06Vk0BwlTzeomN2pSvpHFHkl','2023-01-23 14:46:50','2023-01-23 14:46:50')
,(119,126,'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTH3S9eXHhib_euDjB81rIQsC7W9ZWEu3-yTyueSHAFcG5-_SElhTvYJAo','2023-01-23 14:49:32','2023-01-23 14:49:32')
,(120,127,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcSYyvjRQa3WLlxTM_ufGfBDZZEnPnIb0_8sD66stchjv61s0Y93_6PBK7w','2023-01-23 14:51:48','2023-01-23 14:51:48')
,(121,128,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcT7Hx1NskgErK4sIrkDSUaco-UHKkKiLCK6Vc5W2jbBgmOg5VkeKzrwVv0','2023-01-23 14:54:51','2023-01-23 14:55:25')
,(122,129,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQ0AIgRON4b9EAVgLsyr0fyZBZ__bD-6hkS6Kndt4ZO893LOaTqyKJv39I','2023-01-23 15:04:47','2023-01-23 15:04:47')
,(123,130,'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRfsCJK26ONdW0DzKN-FzHUzW1gOWGa-efNaZP2o-tXJxM6g2dlRVmfEgc','2023-01-23 15:05:56','2023-01-23 15:13:47')
,(124,131,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTeC1zGbmkH90FBEFkYECxkEGYroG5Fh3PqwrpHIMenqHYXL79U1ZR7kg','2023-01-23 15:08:06','2023-01-23 15:08:06')
,(125,132,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQ12ykG_iE-AaTxLVtcF1EhduOdvvSLfl_WXB3DnVVxFVQcFAuuar0WDHxu','2023-01-23 15:11:17','2023-01-23 15:13:37')
,(126,134,'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS6Xtna0da4xpDfu2uWR8llyv6B_bwtxdivFrTr3kSOM5JyvZkjapc5PnQO','2023-01-23 15:13:21','2023-01-23 15:13:21')
,(127,135,'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTy2s5Fmq_uOUboEHx0e9YfuE1xcMcZ7JHgjlMb2ctkv-ZAivapaP-WrDja','2023-01-23 15:18:50','2023-01-23 15:18:50')
,(128,136,'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS23YxgFp3lhgROgfPr9PEuNhChXPQzv_jvnBkCQevwl75KZW598QvowD8h','2023-01-23 15:24:12','2023-01-23 15:24:12')
,(129,138,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTb1bfKqunm998s73QYLhA-8-wxt3eWOennQcCAYY3kFZuJBk4jWjg8knU','2023-01-23 15:53:25','2023-01-23 15:53:25')
,(130,139,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSe3RkX9j3XxgyeJ3qrafdzRTFvKwF-iuEsNvw_t7WaVEP1-DLW_GQwdzZY','2023-01-23 16:12:35','2023-01-23 16:12:35')
,(131,140,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcShrpDDvS-__1in8sZRaKWia47OzzNqBEQ7fgGqtvO9qkzEOGeGgbnCssk','2023-01-23 16:15:29','2023-02-02 22:03:37')
,(132,141,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcR125GHPp0W0AUVAcFY7-q5wmk814I2mteYPZMDvUH7_7s8Wm0PEr5eu10','2023-01-23 16:24:42','2023-01-23 16:24:42')
,(133,142,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcR125GHPp0W0AUVAcFY7-q5wmk814I2mteYPZMDvUH7_7s8Wm0PEr5eu10','2023-01-23 16:25:18','2023-01-23 16:25:18')
,(134,143,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcR125GHPp0W0AUVAcFY7-q5wmk814I2mteYPZMDvUH7_7s8Wm0PEr5eu10','2023-01-23 16:26:18','2023-01-23 16:26:18')
,(135,144,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQcLSOIKlFrNzn9vTAQP3lX6ogLENqat9Y4H7-F7mT2kA30vxvIr_-X1-8','2023-01-23 16:27:50','2023-01-23 16:27:50')
,(136,145,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcR48f33t22Ls_WmGxOJ9UeiQUlo2NwUB6HZ2s4kO1e3XsOsCNHyooj-I4Y','2023-01-23 16:28:27','2023-01-23 16:28:27')
,(137,146,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRgOFjfGfCFpAafB7rc_Gwn6Zdnw4l-IdeN8Y8lK0iBjPRGHsWO_c5B7l0','2023-01-23 16:29:29','2023-01-23 16:29:29')
,(138,147,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQzJRs1H2E9rrdAaCtPBQbm6sC9VH_3of6Nj2vn-9SkMmzyq6pJnU8VNn4','2023-01-23 16:29:59','2023-01-23 16:29:59')
,(139,148,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQCuWnx8TzlCsMPVs6bx6qE5e06SDwWRvwO6ePchpYEk_FTBWgvE7cp0D8','2023-01-24 00:42:08','2023-01-24 00:42:08')
,(140,149,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcSu4oHjF3dYfBqsUYRl2wlpl_R8C_69x5SMQmyZrBKyJtS77Ph4nerIk3c','2023-01-24 00:42:45','2023-01-24 00:42:45')
,(141,150,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcToQm-hTVIgS5jMIfsU1UjvYfVyV7B4YnDIYMlq38nw_9GO01hFKT-ZOSs','2023-01-24 00:43:41','2023-01-24 00:43:41')
,(142,151,'https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSOu0QjSLr0zTgCCWugSHSNrJoztojNEK_1MHsMDo1Lvx0LpH0JVDOxYjU','2023-01-24 00:47:46','2023-01-24 00:47:46')
,(143,152,'https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTQ1rjbkkTE3ZZolm7QFIL8not7R2YJ3nW6yTveotjBv0Rn9jSpmviIgFo','2023-01-24 00:48:37','2023-01-24 00:48:37')
,(179,188,'https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRondSgtgRv4lX9BDt0RPSHsiOPLG5xan2_Rn6VwSTWvIyJ45FmEBKek9Yl','2023-02-02 21:55:11','2023-02-02 21:55:23');

--

insert into plz_tc_fd.tb_anime_view
values (110,100,144,'2023-01-23 21:33:43')
,(111,100,142,'2023-01-23 21:33:47')
,(112,100,142,'2023-01-23 21:34:11')
,(113,100,138,'2023-01-23 21:34:16')
,(114,100,147,'2023-01-23 21:52:32')
,(115,100,140,'2023-01-23 21:52:36')
,(116,100,147,'2023-01-23 21:57:30')
,(117,100,140,'2023-01-24 00:36:52')
,(118,100,149,'2023-01-24 00:43:42')
,(119,100,145,'2023-01-24 14:37:32')
,(120,100,152,'2023-01-24 14:38:49')
,(121,100,152,'2023-01-28 07:59:02')
,(122,100,141,'2023-01-30 21:31:03')
,(123,100,141,'2023-01-30 21:31:07')
,(124,100,152,'2023-01-30 21:33:15')
,(125,100,152,'2023-01-31 18:35:52')
,(126,100,152,'2023-01-31 18:42:59')
,(127,100,152,'2023-01-31 18:43:02')
,(128,100,152,'2023-02-01 15:09:16')
,(129,100,188,'2023-02-02 21:55:20')
,(130,100,140,'2023-02-02 22:03:33')
,(131,100,188,'2023-02-03 08:55:42')
,(132,100,188,'2023-02-03 23:37:48')
,(133,100,188,'2023-02-04 07:23:36')
,(134,100,139,'2023-02-04 20:19:32')
,(135,100,188,'2023-02-09 06:36:21');

--

insert into plz_tc_fd.tb_book
values (100,1,4,'스프링 용어/개념 및 어노테이션 정리','이도겸','https://www.naver.com','y','2023-01-11 22:45:07','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(101,1,4,'JSP의 모든것','이도겸','https://www.naver.com','y','2023-01-11 22:45:07','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(102,1,4,'Spring 오류/에러 정리','이도겸','https://www.naver.com','y','2023-01-11 22:45:07','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(103,1,4,'Client/Server pagination 총정리','이도겸','https://www.naver.com','y','2023-01-11 22:45:07','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(104,1,4,'Mybatis 개념/정리/태그 모음','이도겸','https://www.naver.com','y','2023-01-11 22:45:07','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(174,1,5,'프론트엔드개발을 시작하려해','패스트켐퍼스','https://www.naver.com','y','2023-01-25 00:00:00','2023-01-25 20:35:21','2023-01-25 21:48:27')
,(175,1,4,'Java로 알아보는 자료구조/알고리즘 강의자료(초안)','이도겸','https://www.naver.com','y','2323-01-25 00:00:00','2023-01-25 20:41:42','2023-01-25 22:02:42');

--

insert into plz_tc_fd.tb_book_searching_keyword
values (100,100,'스프링','2023-01-11 22:45:07')
,(101,100,'JSP','2023-01-11 22:45:07')
,(102,100,'오류','2023-01-11 22:45:07');

--

insert into plz_tc_fd.tb_book_thumbnail_img
values (100,100,'','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(101,101,'','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(102,102,'','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(103,103,'','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(104,104,'','2023-01-11 22:45:07','2023-01-11 22:45:07')
,(140,174,'default','2023-01-25 20:35:21','2023-01-25 21:48:27')
,(141,175,'default','2023-01-25 20:41:42','2023-01-25 22:02:42');

--

truncate table plz_tc_fd.tb_book_type;

insert into plz_tc_fd.tb_book_type
valueS (1,'스크립트','SCRIPT','#FF0000','2023-01-02 21:51:42','2023-01-02 21:51:42')
,(2,'책요약본','BOOK_SUMMARY','#0500FF','2023-01-02 21:51:42','2023-01-02 21:51:42')
,(3,'책PDF','BOOK_PDF','#FFF500','2023-01-02 21:51:42','2023-01-02 21:51:42')
,(4,'공부요약본','STUDY_SUMMARY','#04CF00','2023-01-02 21:51:42','2023-01-02 21:51:42')
,(5,'강의요약본','LECTURE_SUMMARY','#7CA800','2023-01-02 21:51:42','2023-01-02 21:51:42')
,(6,'소설','NOVEL','#CF0095','2023-01-02 21:51:42','2023-01-02 21:51:42');

--

truncate table plz_tc_fd.tb_book_view;

INSERT INTO plz_tc_fd.tb_book_view
VALUES (100,100,100,'2023-01-11 22:45:07')
,(101,100,100,'2023-01-11 22:45:07')
,(102,100,101,'2023-01-11 22:45:07')
,(103,100,101,'2023-01-11 22:45:07')
,(104,100,101,'2023-01-11 22:45:07')
,(105,100,101,'2023-01-11 22:45:07')
,(106,100,103,'2023-01-11 22:45:07')
,(107,100,104,'2023-01-11 22:45:07')
,(108,100,104,'2023-01-11 22:45:07')
,(109,100,104,'2023-01-11 22:45:07')
,(118,100,174,'2023-01-25 21:36:49')
,(119,100,174,'2023-01-25 21:45:27')
,(120,100,174,'2023-01-25 21:45:31')
,(121,100,174,'2023-01-25 21:45:46')
,(122,100,174,'2023-01-25 21:48:12')
,(128,100,175,'2023-01-25 21:57:02')
,(129,100,175,'2023-01-25 21:57:04')
,(130,100,175,'2023-01-25 22:02:33')
,(131,100,175,'2023-01-25 22:02:40')
,(132,100,175,'2023-01-25 22:10:24')
,(133,100,174,'2023-01-25 22:12:16')
,(134,100,175,'2023-01-28 08:18:12')
,(135,100,175,'2023-01-30 06:48:41')
,(136,100,175,'2023-01-30 15:47:44');

--

insert into plz_tc_fd.tb_comic_book_searching_keyword
values (100,100,'원피','2023-01-16 02:08:39')
,(101,100,'헌터','2023-01-16 02:08:39')
,(102,100,'원','2023-01-16 02:08:39');

--

insert into plz_tc_fd.tb_movie_searching_keyword
values (100,100,'가위','2023-01-11 22:45:08')
,(101,100,'손','2023-01-11 22:45:08')
,(102,100,'8','2023-01-11 22:45:08');
